// а) Выведите столбец чисел от 1 до 100.

//FOR

var i = 1;
for (i; i<101; i++) {
    console.log(i=+1);
}

//WHILE

//  б) Выведите столбец чисел от 11 до 33.

//  в) Выведите столбец четных чисел в промежутке от 0 до 100.

// г) С помощью цикла найдите сумму чисел от 1 до 100.

// д) Дано число n=1000. Делите его на 2 столько раз, 
// пока результат деления не станет меньше 50. Какое число получится? 
// Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), 
// и запишите его в переменную num.